import React from 'react'

function test() {

 const testString = "甲 등이 신축한 집합건물에 관한 구분소유가 성립하기 전에 대지에 관하여 근저당권이 설정되어 있었는데, 위 대지와 건물에 관한 강제경매절차에서 乙이 대지와 건물을 매수한 후 대지에 관하여 소유권이전등기를 마쳤고, 위 경매절차 개시 전에 건물에 관하여 가등기를 마친 丙이 일부 전유부분에 관하여 본등기를 함으로써 각 전유부분과 전유부분의 대지사용권에 해당하는 토지공유지분이 분리된 사안에서, 위 토지공유지분의 분리는 위 대지 및 건물에 관하여 적법하게 진행된 강제경매절차에서 대지사용권 성립 전에 대지에 관하여 설정된 근저당권이 매각으로 소멸하면서 근저당권이 확보한 담보가치의 보장을 위하여 그보다 뒤에 각 전유부분에 관하여 경료된 가등기의 효력이 대지지분에 대하여 미치지 않게 됨으로 인한 것이므로, 그 후에 각 전유부분에 관하여 가등기에 기한 본등기를 하더라도 집합건물의 소유 및 관리에 관한 법률 제20조에서 금지하는 대지사용권의 분리처분으로 볼 수 없다고 한 사례.";
 const arr = testString.split(" ");
 

  return (
    <div>
      
    </div>
  )
}

export default test
